app/controllers/movies_controller.rb

  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(movie_params)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "movies" SET "title" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["title", "Star Wars: A new Hope"], ["updated_at", "2017-03-21 22:18:25.001464"], ["id", 1]]

  def same_director
    @movie = Movie.find(params[:id])
    director = @movie.director
    if director.empty? then
      flash[:notice] = "'#{@movie.title}' has no director info."
      redirect_to movies_path
    else
      @movies = Movie.where(Director: director)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
SELECT "movies".* FROM "movies" WHERE "movies"."Director" = 'George Lucas'

  def similar
     movie = Movie.find(params[:movie_id])

      @similar_movies = Movie.where('id != ? AND director = ?', params[:movie_id], movie.director)

     if(@similar_movies.empty?)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
SELECT COUNT(*) FROM "movies" WHERE (id != '1' AND director = 'George Lucas')